MariaDB [(none)]> SELECT NOW(), SLEEP(2), NOW();
+---------------------+----------+---------------------+
| NOW()               | SLEEP(2) | NOW()               |
+---------------------+----------+---------------------+
| 2017-11-29 06:46:16 |        0 | 2017-11-29 06:46:16 |
+---------------------+----------+---------------------+
1 row in set (2.00 sec)

MariaDB [(none)]> SELECT SYSDATE(), SLEEP(2), SYSDATE();
+---------------------+----------+---------------------+
| SYSDATE()           | SLEEP(2) | SYSDATE()           |
+---------------------+----------+---------------------+
| 2017-11-29 06:46:24 |        0 | 2017-11-29 06:46:26 |
+---------------------+----------+---------------------+

-- NOW和CURRENT_TIMESTAMP是同义词
-- SYSDATE函数返回的是执行到当前函数时的时间，而NOW返回的是执行SQL语句时的时间。

MariaDB [(none)]> SELECT NOW(), NOW() + 0;
+---------------------+----------------+
| NOW()               | NOW() + 0      |
+---------------------+----------------+
| 2017-11-29 06:54:16 | 20171129065416 |
+---------------------+----------------+

MariaDB [(none)]> SELECT NOW() AS now,
    -> DATE_ADD(NOW(), INTERVAL 1 DAY) AS tomorrow,
    -> DATE_SUB(NOW(), INTERVAL 1 DAY) AS yesterday;
+---------------------+---------------------+---------------------+
| now                 | tomorrow            | yesterday           |
+---------------------+---------------------+---------------------+
| 2017-11-29 06:57:06 | 2017-11-30 06:57:06 | 2017-11-28 06:57:06 |
+---------------------+---------------------+---------------------+

MariaDB [(none)]> SELECT NOW() AS now,
    -> DATE_ADD(NOW(), INTERVAL 1 DAY) AS tomorrow,
    -> DATE_ADD(NOW(), INTERVAL -1 DAY) AS yesterday;
+---------------------+---------------------+---------------------+
| now                 | tomorrow            | yesterday           |
+---------------------+---------------------+---------------------+
| 2017-11-29 06:58:22 | 2017-11-30 06:58:22 | 2017-11-28 06:58:22 |
+---------------------+---------------------+---------------------+


-- DATE_ADD针对闰年的处理：如果目标年份是闰年，那么返回的日期为2月29日；如果不是闰年，那么返回日期是2月28日。
MariaDB [(none)]> SELECT DATE_ADD('2000-2-29', INTERVAL 4 YEAR) AS year;
+------------+
| year       |
+------------+
| 2004-02-29 |
+------------+

MariaDB [(none)]> SELECT DATE_ADD('2000-2-29', INTERVAL 1 YEAR) AS year;
+------------+
| year       |
+------------+
| 2001-02-28 |
+------------+


-- DATE_FORMAT函数
MariaDB [(none)]> SELECT DATE_FORMAT(NOW(), '%Y%m%d');
+------------------------------+
| DATE_FORMAT(NOW(), '%Y%m%d') |
+------------------------------+
| 20171129                     |
+------------------------------+


SELECT * FROM table WHERE DATE_FORMAT(date, '%Y%m%d') = 'xxxx-xx-xx'; --date列如果建立索引，此语句将无法利用该索引，所以效率慢。

SELECT * FROM table WHERE date
between DATE_ADD('2017-11-29', INTERVAL 0 MICROSECOND)
and     DATE_ADD('2017-11-30', INTERVAL -1 MICROSECOND);











